type Schema = {
    [key: string]: string[];
};

export const words: Schema = {
    "t": ["ಟ್", "ತ್",],
    "th": ["ತ್",],
    "thi": ["ತಿ", "ದಿ"],
    "this": ["ದಿಸ್",],

    // "these": ["",],
    "is": ["ಇಸ್", "ಈಸ್",],
    "a": ["ಎ", "ಅ",], //ಆ


    "s": ["ಸ್",],
    "sc": ["ಸ್ಕ",],
    "sch": ["ಸ್ಕ",],
    "scho": ["ಸ್ಕು",],
    "schoo": ["ಸ್ಕೂ",],
    "school": ["ಸ್ಕೂಲ್",],
    "schools": ["ಸ್ಕೂಲ್ಸ್",],

    "my": ["ಮೈ",],

    "nam": ["ನಮ್", "ನೇಮ್", "ನೆಮ್"],
    "name": ["ನೇಮ್", "ನೆಮ್", "ನಮ್"],

    "r": ["ರ್",],
    "ra": ["ರ", "ರಾ",],
    "rah": ["ರಾಹ್",],
    "rahu": ["ರಾಹು",],
    "rahul": ["ರಾಹುಲ್",],

    "layout": ["ಲೇಔಟ್"],
    "stage": ["ಸ್ಟೇಜ್"],
    "block": ["ಬ್ಲಾಕ್"],
    "basaveswara": ["ಬಸವೇಶ್ವರ"],
    "nagar": ["ನಗರ"],
    "seventh": ["ಸೆವೆಂತ್"],
    "plot": ["ಪ್ಲೋಟ್"],
    "koramangala": ["ಕೋರಮಂಗಲ"],
    "feet": ["ಫೀಟ್"],
    "above": ["ಅಬೊವೆ"],
    "bodyworks": ["ಬಾಡಿವರ್ಕ್ಸ್"],
    "spa": ["ಸ್ಪಾ"],
    "colony": ["ಕಾಲೋನಿ"],
    "bangalore": ["ಬೆಂಗಳೂರು"],
    "bengaluru": ["ಬೆಂಗಳೂರು"],
    "karnataka": ["ಕರ್ನಾಟಕ"],


    "road": ["ರೋಡ್"],
    "rd": ["ರೋಡ್"],

    // "street": ["ಸ್ಟ್ರೀಟ್"],



    "savitha": ["ಸವಿತಾ", "ಸವಿತ"],

    "rajeev": ["ರಾಜೀವ್"],
    "rajiv": ["ರಾಜೀವ್",], // "ರಾಜೀವ"
    "raj": ["ರಾಜ್", "ರಾಜ"],
    "raja": ["ರಾಜ್", "ರಾಜ"],

    "ravi": ["ರವಿ",],
    "ravikumar": ["ರವಿಕುಮಾರ್",],
    "kumar": ["ಕುಮಾರ್", "ಕುಮಾರ"],

    "pushpa": ["ಪುಷ್ಪ",],
    "chandrika": ["ಚಂದ್ರಿಕಾ",], //  "ಚಂದ್ರಿಕ"
    "yuktha": ["ಯುಕ್ತಾ",],

    "gita": ["ಗೀತಾ",],
    "geeta": ["ಗೀತಾ",],
    "geetha": ["ಗೀತಾ",],
    "githa": ["ಗೀತಾ",],

    "rashmi": ["ರಶ್ಮೀ",],


    "james": ["ಜೇಮ್ಸ್",],
    "christopher": ["ಕ್ರಿಸ್ಟೋಫೆರ್", "ಕ್ರಿಸ್ಟೊಫೆರ್"],

    "carefully": ["ಕೇರ್ಫುಲಿ"],
    "examined": ["ಎಕ್ಸಾಮಿನ್ಡ್"],
    "the": ["ದಿ"],
    "writing": ["ರೈಟಿಂಗ್"],
    "and": ["ಅಂಡ್"],
    "paper": ["ಪೇಪರ್"],
    "upon": ["ಅಪಾನ"],
    "which": ["ವಿಚ್", "ವಿಛ್"],
    "it": ["ಇಟ್"],
    "was": ["ವಾಸ್"],
    "written": ["ರಿಟನ್"],


    "set": ["ಸೆಟ್"],
    "test": ["ಟೆಸ್ಟ್",],
    "tests": ["ಟೆಸ್ಟ್-ಸ್"],

    "pr": ["ಪ್ರ"],

    "proof": ["ಪ್ರೂಫ್",],
    "proofs": ["ಪ್ರೂಫ್ಸ್",],

    "of": ["ಆಫ್", "ಅಫ್",],
    "concept": ["ಕಾನ್ಸೆಪ್ಟ್",],
    "application": ["ಅಪ್ಲಿಕೇಶನ್",],

    "to": ["ಟು",],
    "transliterate": ["ಟ್ರಾನ್ಸ್-ಲಿಟರೇಟ್"],

    "english": ["ಇಂಗ್ಲಿಷ್"],

    // mathematics ಮ್ಯಾಥೆಮ್ಯಾಟಿಕ್ಸ್
    //  department ಡಿಪಾರ್ಟ್ಮೆಂಟ್

    "n": ["ನ್",],
    "na": ["ನ",],

    "naa": ["ನಾ",],
    "naan": ["ನಾನ",],
    "naanu": ["ನಾನು"],

    "i": ["ಐ", "ಇ", "ಈ"],
    "iv": ["ಇವ್",],
    "iva": ["ಇವ",],
    "ivaa": ["ಇವಾ",],
    "ivaag": ["ಇವಾಗ್",],
    "ivaaga": ["ಇವಾಗ"],

    "k": ["ಕ್",],
    "ka": ["ಕ",],
    "kan": ["ಕನ್",],
    "kann": ["ಕನ್ನ್",],
    "kanna": ["ಕನ್ನ",],
    "kannad": ["ಕನ್ನಡ್",],
    "kannada": ["ಕನ್ನಡ"],
    "kannadad": ["ಕನ್ನಡದ್",],
    "kannadada": ["ಕನ್ನಡದ",],
    "kannadadal": ["ಕನ್ನಡದಲ್",],
    "kannadadali": ["ಕನ್ನಡದಲ್ಲಿ "],

    // ಮಾಡ್ತಿದಾನೆ

    "type": ["ಟೈಪ್"],
    "ty": ["ಟೈ",],
    "typ": ["ಟೈಪ್",],

    "m": ["ಮ್",],
    "ma": ["ಮ",],
    "maa": ["ಮಾ",],
    "maad": ["ಮಾಡ್",],
    "maadu": ["ಮಾಡು",],
    "maadut": ["ಮಾಡುತ್",],
    "maaduth": ["ಮಾಡುತ್ತ್",],
    "maaduthi": ["ಮಾಡುತ್ತಿ",],
    "maaduthid": ["ಮಾಡುತ್ತಿದ್",],
    "maaduthidd": ["ಮಾಡುತ್ತಿದ್ದ್",],
    "maaduthidde": ["ಮಾಡುತ್ತಿದ್ದೇ",],
    "maaduthidden": ["ಮಾಡುತ್ತಿದ್ದೇನ್",],
    "maaduthiddene": ["ಮಾಡುತ್ತಿದ್ದೇನೆ"],

    // berel acchu
    // ಬೆರಳಚ್ಚು

    // ಫಿಂಗರ್ಪ್ರಿಂಟ್


    "have": ["ಹ್ಯಾವ್",],



    "myopia": ["ಮಯೋಪಿಯಾ", "ಮೈಓಪಿಅ",],

    "study": ["ಸ್ಟಡಿ",],
    "at": ["ಅಟ್",],


    // "": ["",],


    // hous, DL distance, trie, ternary tree
    // "house": [""]


};
